{
    "houses": {
        "1": {
            "cusp_txt": [
                "A curious and bright approach. Smart. Quick movements. Scattered energy. Looking elfin or impish. A twinkle in the eye. Up to no good. Mischievous. Boyish looks. Gamine looks. A physical trickster. Giving the impression of being wily, cunning, and clever. A youthful and trendy fashion sense. Physically nervous and high-strung. An approach that is superficial and gossipy. Nail biters. Finger tappers. Knuckle crackers. Knee bouncers. Finding it easy to make natural connections to children (not babies, toddlers, or teenagers). Liking to give nicknames based on appearance. Liking to be “AKA” — also known as someone else. Having more than one physical identity. Androgyny. Boys who look like girls and girls who look like boys. Liking to read all the gossip about yourself. A physical presence that mimics something or someone else. A chameleon. Affecting the speech, movements, and appearance of another person. A personal who acts as a physical mimic. An actor whose main technique is mimicry. You can copy what you see into your physical persona."
            ],
            "house": 1,
            "ruler": "mercury",
            "ruler_txt": [
                "The activities of the 12th house serve the agenda of the 1st house. Releasing grief and sorrow, solitude, escapism, psychic activity and becoming aware of self-sabotage serve the image, persona, behavior, mannerisms, appearance and self-awareness. Your sorrow is one of the first things people notice about you. You create an image of yourself as a person who has suffered. You create an image of yourself as a victim. Your experiences in prison or with people on the fringe of society shape your behavior and approach to life. You are a loner. You make people aware of your pain. Experiences with psychic phenomena shape your approach to life. Your awareness of the paranormal and interest in otherworldly experiences is apparent to other people. You have a spiritual outlook. Your approach is ethereal and hard to pinpoint. Experiences of grief and loss shape your outlook on life. You undermine yourself by associating with people who don’t have your best interests at heart. Your secret enemies influence how you present yourself. Your secret enemies impact your physical appearance. Feelings of sorrow and loss influence the way you dress and style yourself. Interactions with spirits, and meditation, affect how you dress and behave. You have a ghostly countenance. You look sad. Helping those in need is at the forefront of your concerns. You have trouble dealing with everyday reality. You bring imagination to your appearance. The self-undoing comes through your behavior and the way you present yourself. You want to merge with everything. You lose your boundaries as you approach life."
            ],
            "sign": "Gemini"
        },
        "2": {
            "cusp_txt": [
                "Valuing nurturing qualities and motherhood. Valuing women. Defending your personal income. Defending possessions. Collecting baby dolls. Holding onto sentimental possessions. Collecting antiques. Shopping at thrift stores. Liking to purchase things from bygone eras. Nurturing and mothering are survival needs. Earning power is based on mood. Collecting things that mom would like. Collecting lace. Collecting “Precious Moments” figurines. Collecting Vermont Teddy Bears. Protecting belongings. Putting things in containers, sealed bags, glass cases, storage boxes and other containers. Collecting seashells. Collecting old coins and bills. Nurturing the growth of your own money. Saving for a rainy day. Difficulty parting with money. Difficulty parting from old banks or old savings accounts. Difficulty cashing in bonds. Having a safety deposit box. Wanting to keep money and possessions as safe as possible. Displaying mom’s china. Collecting old cupboards, armoires, dressers, hope chests and other furniture that hold or contain other things. Selling antiques on eBay."
            ],
            "house": 2,
            "ruler": "moon",
            "ruler_txt": [
                "The activities of the 6th house serve the agenda of the 2nd house. Health-consciousness, interactions with employees and coworkers, work environment, daily routines and relationships with animals serve material security, spending and earning money, personal values and self-esteem. Daily habits revolve around ways to make money. Daily routines revolve around making ends meet. Your interest in animals can lead to a way to earn money. Your interest in animals leads you to spend money. Your work environment needs to provide material security. Having a daily job makes you feel financially secure. Having servants makes you feel secure. Losing a job threatens your sense of physical security. Relationships with animals help shape your personal values. Relationships with animals affect your self-esteem. Daily routines have an effect on your self-esteem. Diet, nutrition and exercise affect your self-esteem. Health issues impact your self-esteem. You need to find a way to reconcile health concerns with self-esteem. Daily vitamins, health foods and exercise programs are ways to spend and earn money. Health issues begin when you are out of touch with your survival needs. Relationships with animals put you in touch with your survival needs, for better or worse. Health issues impact your personal finances. Health issues impact your survival needs. Employees and coworkers help you earn or spend money. Daily practice builds self-esteem."
            ],
            "sign": "Cancer"
        },
        "3": {
            "cusp_txt": [
                "Talking about family. “Tell me about your mother.” Talking about breasts. Defensive speech. Cooking food for siblings. Acting like a mother to your siblings. Having a sibling who acts like a mother. Being taken care of by a sibling. Nurturing, caring, sensitive, shy siblings. Moody and defensive siblings. Feeling defensive around siblings. Feeling defensive around neighbors. Defensive driving. Speaking in self-defense. Communication power is based on mood. Collecting quotes. Book collections. The person who likes to own first editions. Cookbooks. Collecting family recipes. Parenting how-to books. Parenting blogs, newsletters, pamphlets and Twitterers. Devoting an entire blog to your children or family. Clamming up. Shy and withdrawn in speech. Talking about the “good old days.” Classic cars. Antique cars. Vintage motorcycles. Vintage campers. Vintage bicycles. Writing, speaking and thinking about breasts. Writing, speaking and thinking about being a mother. Writing, speaking and thinking about your mother. Writing about women. Writing about matriarchy. Caring, sensitive, gentle communication. Receptive, nurturing, tenacious communication. Needy communication. Learning to communicate your needs. Most communication is centered on your needs. Most communication is with your mother. Talking, writing and thinking about moods. Communication centers on babies. Communication centers on food. Eating instead of expressing emotions. Emotional communication. Clinging to your hometown. Talking about the sentimental feelings you have for an old neighborhood. Feeling nostalgic about the old neighborhood, or the way the neighborhood used to be. Caring and sensitive bonds with siblings. Collecting sayings and expressions. Keeping sentimental things in the car. The car doubles as a traveling house. An overly protective sibling. Overly protective of your siblings. Defending siblings. Turning neighbors into family."
            ],
            "house": 3,
            "ruler": "moon",
            "ruler_txt": [
                "The activities of the 6th house serve the agenda of the 3rd house. Health-consciousness, interactions with employees and co-workers, daily routines and relationships with animals serve communication and information gathering. Daily routines involve writing, teaching and making small interactions with other people. The daily work environment involves writing, communication, teaching and making small daily connections. You are a working writer. Daily routines revolve around siblings. The work environment must allow us to use your communications skills. Your work environment includes lots of E-mailing, Twitter, Facebook, blogging and other social media. You want your work environment to be stimulating. You want your work to involve writing, teaching and communication. You like being able to take short trips around town while working. Your daily job is a way to make connections with people. Animals have an impact on the way you communicate, or what you write about. Health issues have a bearing on the way you communicate. Daily habits are formed around writing and communication. The work environment revolves around siblings. Health issues begin when you are out of sync with your need to communicate. Relationships with animals put you in touch with your communication needs. You bring a work ethic to communications."
            ],
            "sign": "Cancer"
        },
        "4": {
            "cusp_txt": [
                "Family drama. A warm and loving family. Lots of personal attention at home. A home fit for a king. A personal throne. Needing a personal space for self-expression. Needing a warm and welcoming home. Needing to feel appreciated and acknowledged at home. Needing adequate attention at home. Having an art or game room. Making a stage in your home. “Home stagers.” Home theaters. A family of performers. A family of actors. Having pride in your country. Feeling proud of your family. A generous family. A fun and creative upbringing. A very creative household. A domineering, pompous, haughty, or snobbish parent. A family of snobs. Wanting to be seen at home. Putting your house on display in a home or architecture magazine, or in a television show. MTV’s “Cribs.” Really swanky furnishings. People who actually grow up among royalty. One parent gave copious amounts of personal attention (for better or worse). A grand family. A grand house. Needing to be the center of attention in a home, family, or country. An overbearing, domineering, and egocentric parent. A warm, creative, and fun parent. A drama queen (or king) for a parent. A vain, domineering, and self-centered person at the core. A creative and courageous person at the core. Privately creative. Privately needing to feel special. Being an authority on your family or country. A family of conceited people. Privately conceited."
            ],
            "house": 4,
            "ruler": "sun",
            "ruler_txt": [
                "The activities of the 12th house serve the agenda of the 4th house. Releasing grief and sorrow, solitude, escapism, psychic activity and becoming aware of self-sabotage serve emotional security, building a psychological foundation, familial relationships, roots and heritage. Sorrow and loss directly impact your core psychological makeup. Loneliness affects your emotional security. Dreams affect your emotional security. You experience sadness and loss through family relationships. You experience grief and sorrow through parental relationships. You take people into your home who are down on their luck. You start a halfway house. You open your home to those in need. You are involved with a homeless shelter. You live with people who do not have your best interests at heart. Your secret enemies are in your own home. Your home is a refuge. You need privacy and alone time at home. You are a recluse. The self-undoing comes through family. The self-undoing comes through cultural ties. The self-undoing comes through experiences with your ancestry or roots. The self-undoing is a family legacy. You bring a dreamy and otherworldly presence to your family and home life. You practice spirituality, prayer and meditation in the privacy of your own home. Charity begins at home. You bring imagination to your home. You want to merge with your home and family. You lose your boundaries when it comes to home and family. Haunted house."
            ],
            "sign": "Leo"
        },
        "5": {
            "cusp_txt": [
                "Enjoying tedious tasks. Getting pleasure from detail work. Embroidery as a hobby. Sports that require specific technical skills. Hobbies and interests that are detail-oriented and require specific technical skills. Working at a hobby. Taking care of your health is a hobby. Buying health products for fun. Eating health food for fun. Getting pleasure from taking care of the body. Getting pleasure from being healthy. Sports that require peak health. Seeking peak health is a hobby. Studying health for fun. Sports medicine. Getting enjoyment from studying. Getting pleasure from being a good student. Teacher’s pet. Scheduling fun. Scheduling romance. Being critical of your children. Helping your children achieve their very best. Helping children study. A tutor for children and teens. Critical, narrow-minded children. Fault-finding, pessimistic, obsessive-compulsive children. Technically skilled, organized, and well-disciplined children. Being obsessive-compulsive about the health of your children. Children who are health-conscious. Children who are obsessive-compulsive about their health. Sports that require manual dexterity. Someone who treats child-rearing like a job. Treating sports activities like a job. Treating creative activities like a job. Daily creativity. Daily sports. A creative routine. A sports routine. Setting routines for children. A daycare worker. An Etsy.com shop owner. Attracted to people who are picky, fault-finding and petty. Attracted to people who are humble, helpful and unselfish. Attracted to people who are technically skilled and manually dexterous. Attracted to efficient workaholics. Attracted to critics. Romances with health-conscious clean freaks. Romances with hypochondriacs. Picky about romantic partners. Finding fault with romantic partners. Wanting a flawless romance. Wanting flawless children. Plastic surgery for fun. Wanting a flawless sports performance. Timid about taking risks. Appropriate risk-taking. Willing to take risks to help children. Risk analysis. A skillful risk-taker. A truly creative craftsman. Someone who has the technical skill to execute a creative impulse. Someone who is skilled in the technical portion of a sport. Someone who has the technical skill needed for a hobby or interest. Dating a technically skilled person. Dating a craftsman. Practical fun. Practical romances."
            ],
            "house": 5,
            "ruler": "mercury",
            "ruler_txt": [
                "The activities of the 12th house serve the agenda of the 5th house. Releasing grief and sorrow, solitude, escapism, psychic activity and becoming aware of self-sabotage serve creativity, personal self-expression, risk-taking, hobbies, romance and interactions with children. Your experiences of grief and sorrow influence your creative work. You express your pain through music, art, theater, photography or dance. You bring a dream-like quality to your artistic performances. You channel entities from other worlds through your creative process. You are involved in a prison athletics program. You work in a museum because of your love of art. You work in a children’s hospital. You help charities through sports activities. You are creative when you are alone. You express spirituality through artistic projects. You compose spiritual music. You paint spiritual images. You meditate on paintings. You create music for meditation. You take dream-like photographs. You experience loss in relationships with your children. You experience grief and sorrow in relationships with children. You escape everyday reality by plunging into your hobbies. You escape everyday reality by having affairs. You escape reality by having frivolous sex. There’s a sense of loss even when you’re having fun. Meditation is fun for you. Spiritual retreats satisfy your sense of fun. Exploring spirituality and the paranormal are pleasurable for you. Ghosts become lovers. You encourage your children to be open to the possibility of ghosts and other worlds. You experience grief and sorrow through romance. You bring imagination to your art. The self-undoing comes through romance. You want to merge with your art or with your children. You lose your boundaries when it comes to your children."
            ],
            "sign": "Virgo"
        },
        "6": {
            "cusp_txt": [
                "Sweet tooth. Diabetes. Kidney disease. Beauty routines. Wanting to work in a beautiful and pleasing environment. Needing to be surrounded by beauty every day. Daily indecision and vacillation. Passive on a day to day basis. Vanity and superficiality are part of the daily routine. Eating sweets is part of the daily routine. Tactful, diplomatic interactions with coworkers and employees. Showing a fair and balanced approach to employee and coworker relationships. An agreeable person on the job. Passive and indifferent toward everyday work. Waiting for someone else to do the housework. Letting the partner do all the cleaning. Expecting the partner to look after your health. Expecting coworkers to pick up the slack. Equal opportunity employment. Liking to work on a team of two. Passive attitude to health, diet and exercise. Inability to take action on health, diet and exercise. Not caring one way or the other about your health. Not caring one way or the other about animals. Feeling that animals are equals. Feeling that coworkers are equals. Feeling that employees are equals. Eating equal portions. A balanced diet. A diet that vacillates from very healthy to very poor. Weight vacillations. Inability to decide on a diet or exercise routine. Always doing the opposite of whatever the doctor says. Romance is medicine. Being in a relationship is like medicine. Working at a co-op. Working as a makeup artist, hair stylist, or in a clothing store. Fashion is a day to day concern. Beauty is a day to day concern. Equality and fairness are day to day concerns. Working for equality and fairness every day. A person who is easy to get along with on an everyday basis. Working as a paralegal. Daily negotiations. Employee negotiations. Employment and labor law. Health law. Exercise that builds balance. Bosu ball exercises. Needing to keep a precise balance of food intake. Balancing liquid and food intake. Balancing the sugar intake."
            ],
            "house": 6,
            "ruler": "venus",
            "ruler_txt": [
                "The activities of the 12th house serve the agenda of the 6th house. Releasing grief and sorrow, solitude, escapism, psychic activity and becoming aware of self-sabotage serve the need to be healthy, employed, have a routine and interact with animals. You experience sadness and loss through relationships with animals. You get in touch with your spiritual side through animals. Dreams offer health advice. Work with charity is part of your everyday routine. Being in a hospital, prison, or other institutional environment is part of your everyday work routine. You experience loss, grief and sadness routinely. You cope with sorrow one day at a time. The desire to escape reality affects your ability to hold a job. You are dreamy and unfocused in your daily work. You bring imagination to your daily work. You find it easier to deal with daily tasks when you’re alone. You are unfocused when it comes to diet and exercise. You experience loss and sorrow through relationships with coworkers and employees. Secret enemies come in the form of employees and coworkers. You bring a spiritual approach to your interest in diet and health. You use meditation techniques to improve your health. You lose your job more than the average person. You experience sorrow and loss through health issues. Being alone too much causes health issues. You have an imaginative approach to diet and health. You desire to escape from daily life. You desire to escape from health concerns. You interact with spirits through animals. The self-undoing comes through health. The self-undoing comes through animals. The self-undoing comes through a coworker. You want to merge with your work. You experience sorrow through servitude."
            ],
            "sign": "Libra"
        },
        "7": {
            "cusp_txt": [
                "Looking for a partner with a fantastic sense of humor. A religious spouse or partner. Going into business with a religious person. Going into business with someone from a different country. Going into business with someone from a different culture or religion. Confrontations with religious zealots. Confrontations with opinionated, dogmatic, arrogant people. Confrontations with adventurous scholars. Confrontations with wise philosophers. Confrontations with blunt and tactless people. A partner or spouse who is blunt and tactless. A partner or spouse who is optimistic, freedom-loving and adventure-seeking. A partner or spouse who loves animals and the great outdoors (even if he doesn’t spend any time outdoors or with animals, he likes the idea of them). A partner who is always on the move. A partner who doesn’t want to be pinned down. A significant other who won’t commit. A condescending partner. A spouse who doesn’t take the marriage seriously. Treating marriage like a joke. A dogmatic partner. A partner with strong ethical, moral and religious values. A partner who is wise and open-minded. A partner who is interested in metaphysics. Marrying a gambler. Marrying someone who takes unnecessary risks. Marrying a member of the clergy. Marrying a guru. Marrying an adventurous, athletic, sportsperson. Marrying an explorer. Marrying an open-minded truth-seeker. Confrontations with religious people. Confrontations with dogmatic, opinionated people. Confrontations with condescending and pompous people. Traveling with the partner. The partner is from a foreign country. The partner is from a different religious or cultural background. Confrontations with religion. Confrontations with foreign countries. Confrontations with people of other cultures. Marrying an outdoorsy type. Marrying a cafe philosopher. Marrying a foreign diplomat. Exaggerating confrontations."
            ],
            "house": 7,
            "ruler": "jupiter",
            "ruler_txt": [
                "The activities of the 9th house serve the agenda of the 7th house. Expanding horizons, traveling, publishing, and exploring foreign cultures and belief systems serve cooperation, conflict, significant partnerships and negotiations. Foreign people are potential marriage partners. You bring a philosophical attitude to your significant relationships. You can be condescending to your partner. Your personal beliefs affect your ability to find a partner. You bring a religious outlook to marriage and relationships. Religion becomes an issue in marriage. Personal belief systems are an issue in marriage. Cultural background becomes an issue in marriage. In-laws affect your marriage. Your in-laws live with you. You want a partner who has an equal interest in traveling. You want a partner with the same religion or culture. You want a partner who has the same level of education. You want a partner who equally interested in the big picture. You want a partner with an open mind. You want a philosophical partner. Your religious outlook affects your ability to relate to people. You find meaning through marriage and significant relationships. You marry or have a significant relationship with a person from a foreign country."
            ],
            "sign": "Sagittarius"
        },
        "8": {
            "cusp_txt": [
                "Knee surgery. Insurance for the elderly. Strictly sex. Domination. The elderly are sexy. Sexually attracted to older people. Sexually attracted to father figures. Acting like a father figure during sex. Wanting to be taken to task during sex. Wanting to be disciplined during sex. Wanting to be or have a master or dominatrix. Disciplined sexual practices. Sex is hard work. Working hard in the bedroom. Serious sex. Sex is serious business. The sex industry. Denying yourself sex. Sex is a burden. Sexual responsibility. Sexually ambitious. Setting sexual goals. Sexual reputation. Practical sex. Inheriting old money. Sexual traditions. Traditional roles in sex. Turned on by a suit and tie. Turned on by well-established people. Teeth are sexy. Bone structure is sexy. Dying at a ripe old age. Success is sexy. Ambition is sexy. Being controlled is sexy. Unimaginative sex. Conservative sex. Climbing the ladder of success through sex. Sexual ambitions. Successful sex business. Professional sex. Escort service. Prostitutes. Sex to get ahead. Calculating when it comes to sex. Calculating your inheritance. Leaving a legacy of success. Leaving a legacy of ambition and achievement. Sexually cold. Rigid sexual expectations. Strict guidelines when it comes to sex. A sexual taskmaster. Striving for status as a sex symbol. Sexually starved. Sexually attracted to people with a dry sense of humor. Skin and bones are sexy. Sexually attracted to authority figures. An authority on sex. Sexual boundaries. Conservative investments. Corporate investor. Using other people for sex. Using your sexuality to reach goals and achieve ambitions. A dutiful approach to sex. Digging for bones. Maturity is sexy. Taking charge is sexy."
            ],
            "house": 8,
            "ruler": "saturn",
            "ruler_txt": [
                "The activities of the 11th house serve the agenda of the 8th house. Connecting with like-minded people, attitudes to social reform, long term hopes and dreams, and gaining friends and fans serve transformation, attitudes to life and death, other people’s resources, sex and the desire to dig deep. Your causes involve an intensity of experience. Your causes involve taboo subjects. Your causes bring up strong emotional reactions in other people. Your groups offer opportunities to explore the taboo. You create groups of like-minded people an interest an interest in occult subjects. You are interested in group sex. You find friends because of your interest in sex. You connect with strangers through your interest in taboo subjects. You look to your sex partner to fulfill your long term hopes and dreams. You belong to a sex club. You associate with people who are involved in the occult. Your friends have emotional baggage. You keep your group involvements hidden. You belong to a secret society. You don’t talk about your associates. You don’t talk about the groups you belong to. You don’t talk about your long term hopes and wishes. Your groups offer opportunities for transformation. You bring a detached and experimental attitude to sex. You bring an objective eye to the subject of death. You make connections with people because of your debt. You connect with strangers because of your sexual experiences. You make connections with strangers through shared experiences involving the occult or taboo. You join debtors anonymous."
            ],
            "sign": "Capricorn"
        },
        "9": {
            "cusp_txt": [
                "Conservative publications. Business publications. Educational traditions. A practical and realistic philosophy. Ambitions in religion. Ambitions in publishing. Ambitious journalists. Successful religious gurus. Ambitions to be a guru. Ambitions to be a religious or cultural leader. Successful religious leaders. Conservative philosophy. Conservative education. Stuffy academics. A philosophy of responsibility. Conservative theory. Taking philosophy seriously. Recognized colleges with a reputation and tradition. An education in the classics. “Old school.” A classical education. Educational achievement. Ambitious education. Educational goals. Business school. Architecture school. Religious traditions. Business guides and mentors. Conservative journalism. Architecture publications. Supreme Court. Respectful of religion. Authoritative religious figures. Organized religion. Conservative ideology. Traditional education. Using religion to send a message. Useful theories. Useful beliefs. Useful publications. Traditional ideas. Practical theories. Practical ideas. Materialistic theory. Materialistic philosophy. Patriarchal religions, theories, and philosophies. The same religion as Dad. The same ideas as your father. Feeling protected by religion. A philosophy of duty. Mountaineering magazines."
            ],
            "house": 9,
            "ruler": "saturn",
            "ruler_txt": [
                "The activities of the 11th house serve the agenda of the 9th house. Connecting with like-minded people, attitudes to social reform, long term hopes and dreams, and gaining friends and fans serve expanding horizons, traveling, publishing, and exploring foreign cultures and belief systems. Your friends reinforce your opinions about people from other cultures, for better or worse. Your friends take part in the same religion that you do. You friends are travel companions. You make friends when you expand your horizons. You make friends when you travel. You make friends through a mutual interest in academia, journalism or publishing. Your friends are lawyers. You form travel groups or travel clubs. You organize trips for your organization. You plan trips for the groups you belong to. You plan trips with your friends. You enjoy having traveling companions. You look to religion to fulfill your long term hopes and wishes. You make friends with people who see the big picture. Your friends are philosophical. You friends are opinionated and have a strong belief system. Your long term wishes involve the accumulation of knowledge. You belong to academic groups. You belong to associations for lawyers. You are a member of the clergy. Your friends should have a shared interest in discovering the meaning of life. Your friends should have a shared interest in traveling. You belong to groups that have international membership."
            ],
            "sign": "Capricorn"
        },
        "10": {
            "cusp_txt": [
                "Working with groups and organizations. Progressive and visionary careers or businesses. Being friends with the boss. Working with technology. A science career. Working as a social reformer. Viewing authority figures as peers. A reputation for being unusual, bizarre, eccentric, or strange. Astrology career. Careers that haven’t been invented yet. Unusual business practices. Working on behalf of social reform. Making social reform the life’s work. Being known for your eccentricities. Being known for being exciting. Being known for being extreme. Liking to work with groups of people. A person who works in team building. Liking to work with technology. Internet technology careers. Being known for having an interest in extraterrestrial life. Being known as a friendly, yet aloof person. A detached approach to career matters. Being known for group involvements."
            ],
            "house": 10,
            "ruler": "saturn",
            "ruler_txt": [
                "The activities of the 11th house serve the agenda of the 10th house. Connecting with like-minded people, attitudes to social reform, long term hopes and dreams, and gaining friends and fans serve building a reputation, gaining recognition for achievements and finding a vocation. You climb to the top with the help of friends. The organizations you belong to give you a boost up. You make friends through your profession. You become friends with celebrities. You become involved in various groups and organizations to enhance your reputation and gain public exposure. Your involvement in social reform makes you famous. Your friends make you famous. You become well known for your causes. You become well known because of your fans. You become well known for the audiences you attract. You make friends to improve your status. You make friends to gain recognition. You receive awards for your involvement in the global community. You receive awards for your humanitarian efforts. You make a cause famous. You bring social issues out into public awareness. You make your friends famous. You bring your friends into the limelight. You become well known for being part of a group. You become well known for your group efforts. You become well known for having an individual voice within a movement. You have a democratic approach to your professional life. Your involvement in groups can lead to a career. You can turn a cause into a full time career. Social reform can become a profession. You are a fanatic when it comes to your profession. The members of your groups make you an authority."
            ],
            "sign": "Aquarius"
        },
        "11": {
            "cusp_txt": [
                "Self-transcendence through involvement in groups, clubs, organizations, causes, friends and fans. Merging with the group. Losing your identity in the group. A martyr for the cause. Spiritual or mystical groups. Meditation groups. Selflessly working on behalf of a group or cause. Victims’ groups. Victims’ support groups. Alcoholics Anonymous. Narcotics Anonymous. Being involved with spiritual movements. Dance troupes. Musicians’ organizations and groups. Film organizations and groups. Photography organizations and groups. Friends with photographers, musicians and imaginative people. Fishing club. Swim team. Polar Bear Club. Friends who are spiritual, compassionate and kind. Unhealthy merging with friends. Poor emotional boundaries with friends. Delusional and chaotic friends and fans. Associating with delusional or drug-addicted people. Groups that transcend physical boundaries. Groups for clairvoyants. Sharing photographs and films among large groups of unrelated people. Netflix, Flickr, Photobucket, etc… Film buff clubs. Long term goals that involve becoming a musician, poet, filmmaker, or spiritual person."
            ],
            "house": 11,
            "ruler": "jupiter",
            "ruler_txt": [
                "The activities of the 9th house serve the agenda of the 11th house. Expanding horizons, traveling, publishing, and exploring foreign cultures and belief systems serve connecting with like-minded people, attitudes to social reform, long term hopes and dreams, and gaining friends and fans. You join religious organizations. You join groups in which members share a belief. You push for education reform. You push your religious agenda on the rest of society. You push for the acceptance of fringe religious movements. You join an association for journalists. You belong to an academic club. You’re a member of a cultural affairs committee. You find meaning through group involvement. You find meaning by being involved in social causes. You impose your personal beliefs on your friends. Your belief system has to adapt to your friendships. You find meaning in group experience. You explore metaphysical ideas in groups. Your interest in foreign culture leads you to make friends and acquaintances. Your interest in foreign cultures leads you to start social movements, for or against those people. Religion shapes your long term goals and dreams. Your capacity to become a guru determines how many fans and supporters you gain."
            ],
            "sign": "Pisces"
        },
        "12": {
            "cusp_txt": [
                "Fighting on behalf of spiritual beliefs. Independent spirituality. Independent meditation. Unaware of the need to be self-reliant. Independent viewpoints attract secret enemies. Spiritual movement. Actively spiritual. Unaware of self-centered tendencies. Inability to acknowledge selfishness. Dreams of independence. Violent feelings at the subconscious level. The urge to gain independence from past karma. Violent dreams. Aggressive fantasies. Subconsciously attracting violent and dangerous people. Being unaware of getting into dangerous situations. Dreaming of being first. Dreaming of being a sports star. Dreaming of being an action hero. Feeling completely isolated. Independent spiritual retreats. Liking to sleep alone. Moving around a lot while sleeping. Active dreamers. Acting on dreams. Actively engaging the dream world. Angry about losses and sorrow. The fear of losing your independence. Unacknowledged anger. Unacknowledged courage. Secret weapons. Hidden military agendas. Starting a hospital or charity. Veterans’ hospitals. Inner toughness. Independently introspective. Bravely embracing the unknown. Having the courage to face inner demons."
            ],
            "house": 12,
            "ruler": "mars",
            "ruler_txt": [
                "The activities of the 11th house serve the agenda of the 12th house. Connecting with like-minded people, attitudes to social reform, long term hopes and dreams, and gaining friends and fans serve the need to release grief and sorrow, spend time alone, melt into formless bliss, escape from reality and become aware of the self-undoing. Friends help you release grief and sorrow. You join support groups for the grief-stricken. Your groups involve inmates, charities or the underprivileged. You start a group in a hospital. You start an organization involving prisoners or the jail system. You push for social reform in prisons. You push for social reform in hospitals. You push for reform in museums. Your causes champion the needy. Your causes include raising awareness of paranormal activity. You become involved in a group of mediums or psychics. You join a psychic network. You join a support group for people with family in prison. Groups bring out your worst fears. You meditate in a group. Your friends are escapists. Your friends are drug addicts or other people seeking to escape the obligations of everyday reality. You belong to groups that promote spirituality. You organize large groups of people for spiritual retreats. You organize a hospital. Your long term hopes and wishes involve finding a place where you can retreat. Too much group activity makes you want to be alone. Your friends cause you a lot of grief and sorrow. Your friends share your interest in ghosts, psychic activity and the paranormal. Your friends are in prison. Your friends are monks. Your friends are ethereal and spiritual. You share a mutual interest in meditation with your friends. Your friends need a lot of alone time. You’d rather be by yourself. You are a fanatic when it comes to paranormal activity."
            ],
            "sign": "Aries"
        }
    },
    "planets": {
        "jupiter": {
            "aspects": [{
                    "accuracy": 0.4503142247111782,
                    "planet_a": "moon",
                    "planet_b": "jupiter",
                    "type": "sextile"
                },
                {
                    "accuracy": 0.37819063749219595,
                    "planet_a": "sun",
                    "planet_b": "jupiter",
                    "type": "square"
                },
                {
                    "accuracy": 6.57510545540282,
                    "planet_a": "mars",
                    "planet_b": "jupiter",
                    "type": "square"
                }
            ],
            "house_txt": [
                "If you have Jupiter in the 9th House, you are optimistic, tolerant, broad-minded, considerate and maybe a little bit fanatical. You may be prophetic, having strong intuition, good judgment and vivid dreams. You may be interested in law, religion and philosophies. You have the ability to guide and inspire others as to what the future might bring and to promote your own thoughts, ideas and ideals. You may benefit from travels and dealings with foreigners. Your accomplishments may not be recognized until the latter part of your life. On the negative side you may be quite dogmatic in your beliefs. Some experience a total absence of faith."
            ],
            "placement": {
                "degree": 16.4269992479351,
                "house": 9,
                "name": "jupiter",
                "sign": "Capricorn"
            },
            "sign_txt": [
                "If you have Jupiter in Capricorn, your positive qualities are honesty, sincerity, faithfulness, ingenuity, resourcefulness and some degree of mechanical ability. Your attempts at growth, expansion, meeting new opportunities and getting ahead in the world are met with reserve, discipline, caution, system, practicality and organization. You have a desire for material success, yet this may not bring satisfaction or happiness if gained. There may be a tendency toward miserliness and withholding yourself from the rest of the world, financially and emotionally. You hate waste, are self-reliant and self-controlled, and possess a desire to have authority over others. You can rise to great heights if you stay honest, truthful, respectful, and keep your nose clean doing everything above-board."
            ]
        },
        "mars": {
            "aspects": [{
                    "accuracy": 6.953296092895073,
                    "planet_a": "sun",
                    "planet_b": "mars",
                    "type": "cunjunction"
                },
                {
                    "accuracy": 7.291132988315383,
                    "planet_a": "venus",
                    "planet_b": "mars",
                    "type": "sextile"
                },
                {
                    "accuracy": 5.7026280470600454,
                    "planet_a": "mars",
                    "planet_b": "uranus",
                    "type": "sextile"
                },
                {
                    "accuracy": 0.16167227115207794,
                    "planet_a": "mars",
                    "planet_b": "rising",
                    "type": "sextile"
                },
                {
                    "accuracy": 0.8787262126091377,
                    "planet_a": "mars",
                    "planet_b": "midheaven",
                    "type": "sextile"
                },
                {
                    "accuracy": 6.57510545540282,
                    "planet_a": "mars",
                    "planet_b": "jupiter",
                    "type": "square"
                },
                {
                    "accuracy": 7.009262563127322,
                    "planet_a": "mars",
                    "planet_b": "pluto",
                    "type": "trine"
                }
            ],
            "house_txt": [
                "If you have Mars in the 11th House, you have strong desires and wishes, social leadership ability and many casual associations with energetic and enterprising friends. You probably put a lot of energy into your friendships. It is important that you seek the right type of friendships. You can be taken advantage of by friends or you can take advantage of them. Active participation in group activities suits you well. Leadership within the group also appeals to you."
            ],
            "placement": {
                "degree": 9.851893792532257,
                "house": 11,
                "name": "mars",
                "sign": "Aries"
            },
            "sign_txt": [
                "If you have Mars in Aries, you are aggressive, pioneering, adventurous, and always on the outlook to start new projects. You hate restraint and don't like to be told to do something or how to do it. You want to lead, not follow. At times you can be headstrong, impulsive, and impatient. Waiting is not something that appeals to you. You go after what you want with great zeal and you do not take \"no\" for an answer. You love competition and anything that allows you to test or prove yourself. Cooperation is not your strong suit and you can be very self-willed, self-absorbed, and selfish at times. The \"me-first\" attitude is strong in you. You are self-reliant and hate depending or relying on others. You need to be our own person and do things your way, even if it might not be the best way. Your best talent is in getting things off the ground quickly. If initial success does not come quickly, you may get tired of that project and move to the next. Sustaining is not your strong side. Long term efforts are not as appealing to you as quick, short term affairs that you can finish with quickly so you can start something else. Energy and enthusiasm are your strong side. Self-control is important for you to learn so you don't burn out. Physical activity and keeping in shape appeals to you. You may be prone to accidents due to haste. You need to learn to stick to a project until it is finished before rushing off on a new endeavor. You must learn to control your temper and impulsiveness."
            ]
        },
        "mercury": {
            "aspects": [{
                    "accuracy": 9.587056001058897,
                    "planet_a": "sun",
                    "planet_b": "mercury",
                    "type": "cunjunction"
                },
                {
                    "accuracy": 1.213817093996397,
                    "planet_a": "mercury",
                    "planet_b": "neptune",
                    "type": "square"
                }
            ],
            "house_txt": [
                "If you have Mercury in the 12th House, you have a perceptive, intuitive and subtle mind with an interest in the metaphysical world. You can absorb knowledge intuitively and you understand more than you wish to divulge. You are secretive and have the ability to understand the deeper meanings of tones of voice and hand gestures. Secret enemies may try to undo you or speak evil of you. You may lack confidence in yourself. You may find yourself limited or incapacitated if you allow your nerves to become too frayed. Be careful of your ears and your hearing, which may be weak."
            ],
            "placement": {
                "degree": 26.392245886486215,
                "house": 12,
                "name": "mercury",
                "sign": "Aries"
            },
            "sign_txt": [
                "If you have Mercury in Aries, you are outspoken and direct in speech and actions. Your thoughts are original and filled with enthusiasm and great energy. You love a good argument or debate and like to compete and strategize with your mind. You say what you mean and don't pull any punches. You are opinionated and love to share those opinions, even if not asked to do so. You love controversy and might need to develop a little more tact in how you express your own thoughts. Your mind is restless and filled with much nervous energy. It is hard for you to sit still. You always have to be busy, especially with your hands. Mechanical ability may be present. Your thoughts and words are quick and impulsive and you may at times suffer from foot-in-mouth disease. A lack of patience and concentration in carrying out your plans may be evident. Great wit and an entertaining personality help make you popular. You don't like to be told how to do things and want the freedom to do things your own way. There never seems to be enough time to do all the things you have on your mind. You may be quick-tempered, but hardly ever carry a grudge. You get over things quickly, then move on."
            ]
        },
        "midheaven": {
            "aspects": [{
                    "accuracy": 4.823901834450908,
                    "planet_a": "uranus",
                    "planet_b": "midheaven",
                    "type": "cunjunction"
                },
                {
                    "accuracy": 7.832022305504154,
                    "planet_a": "sun",
                    "planet_b": "midheaven",
                    "type": "sextile"
                },
                {
                    "accuracy": 0.8787262126091377,
                    "planet_a": "mars",
                    "planet_b": "midheaven",
                    "type": "sextile"
                },
                {
                    "accuracy": 7.00351744330078,
                    "planet_a": "moon",
                    "planet_b": "midheaven",
                    "type": "square"
                },
                {
                    "accuracy": 6.412406775706302,
                    "planet_a": "venus",
                    "planet_b": "midheaven",
                    "type": "trine"
                }
            ],
            "placement": {
                "degree": 8.973167579923143,
                "house": 10,
                "name": "midheaven",
                "sign": "Aquarius"
            },
            "sign_txt": [
                "You bring an unconventional attitude to your life's work and you love excitement, glamour, and originality. You're willing to follow a genius idea to its fruition, even if that means bucking tradition and being labeled a rebel in your field. It's possible, you'll make sudden breakthroughs that gain you notoriety. You are challenged by gadgets and cosmic science and could be drawn into astronomy, astrology, computer science, engineering.But you're just as likely to ride the currents of trends, in fashion, design, experimental art, and music. You may make your mark as an instigator for social change, especially progressive causes that you believe will better humanity. You might find special interest in the idea of extra-terrestrial life, and pursue it as part of your quest to go beyond the usual limits of thought."
            ]
        },
        "moon": {
            "aspects": [{
                    "accuracy": 0.4503142247111782,
                    "planet_a": "moon",
                    "planet_b": "jupiter",
                    "type": "sextile"
                },
                {
                    "accuracy": 11.629377957258669,
                    "planet_a": "moon",
                    "planet_b": "neptune",
                    "type": "sextile"
                },
                {
                    "accuracy": 11.827419277751687,
                    "planet_a": "moon",
                    "planet_b": "uranus",
                    "type": "square"
                },
                {
                    "accuracy": 7.00351744330078,
                    "planet_a": "moon",
                    "planet_b": "midheaven",
                    "type": "square"
                },
                {
                    "accuracy": 0.8285048622033742,
                    "planet_a": "sun",
                    "planet_b": "moon",
                    "type": "quincunx"
                }
            ],
            "house_txt": [
                "If you have the Moon in the 6th house, you are considerate of fellow workers and desire to nurture them in a productive work environment. Service to others is a fine outlet for your personality. Moodiness and sensitivity can be a problem, though. Fluctuations in health are possible, perhaps mostly due to worry and feelings of insecurity. Emotional tension along with digestive troubles indicate the need to relax. Stop worrying. You should not eat when overworked, overtired, or when you are upset. Take care of your health and watch your diet. Concerning vocation: You are probably totally absorbed within your work situation. You can be a workaholic. Many job changes are possible and working with the public or with women is indicated."
            ],
            "placement": {
                "degree": 15.976685023223922,
                "house": 6,
                "name": "moon",
                "sign": "Scorpio"
            },
            "sign_txt": [
                "If you have the Moon in Scorpio, you are secretive and inclined to brood in silence over the wrongs that people have done, either in reality or simply in your own mind. The mental and emotional focus may be on sensual things or on sex or death. You find it difficult to trust people as you are suspicious of their inner thoughts and plans. You open yourself up to very few as you do not find it easy to trust others. Allowing yourself to be vulnerable and to relinquish control in relationships is not easy for you. You love with passion and you hate with passion. Everything is done emotionally, with intensity. You can be very jealous and possessive in your relationships. Perhaps your mother was very controlling. You have a habit of holding on to wrongs that have been done in the past and not forgiving nor forgetting, and to keep such feelings to yourself. Guilt, resentment and vindictiveness need to be overcome. You must learn to let go or your health will suffer. Learn to express your feelings outwardly rather than repressing them within. You are not content with superficial appearances and are always probing beneath the surface of things for hidden motives. You have a great deal of emotional depth. The potential for success is great when control and discipline are learned. You are magnetic, energetic, independent, aggressive, patient, and determined. Self-control of the passions is mandatory."
            ]
        },
        "neptune": {
            "aspects": [{
                    "accuracy": 11.629377957258669,
                    "planet_a": "moon",
                    "planet_b": "neptune",
                    "type": "sextile"
                },
                {
                    "accuracy": 2.2697860949708115,
                    "planet_a": "saturn",
                    "planet_b": "neptune",
                    "type": "sextile"
                },
                {
                    "accuracy": 10.800873095055294,
                    "planet_a": "sun",
                    "planet_b": "neptune",
                    "type": "square"
                },
                {
                    "accuracy": 1.213817093996397,
                    "planet_a": "mercury",
                    "planet_b": "neptune",
                    "type": "square"
                },
                {
                    "accuracy": 4.95469782373425,
                    "planet_a": "venus",
                    "planet_b": "neptune",
                    "type": "trine"
                }
            ],
            "house_txt": [
                "If you have Neptune in the 9th House, you tend to be idealistic, reverent, mystical and philosophical. You are drawn to ideas that espouse the oneness of all life and the idea of the immortal life of the Spirit. Dreams can be very vivid and possibly prophetic. If carried too far, your religious or metaphysical beliefs could border on fanaticism. Good judgment in these areas can be clouded and confused. Exaggeration can be present. Trouble with in-laws may surface due to lack of compassion and understanding. Be careful who you choose to follow as you may encounter wolves in sheep’s clothing. In your travels you prefer to wander around on your own without too much planning or forethought. Strange, unforeseen things can occur while traveling long distances."
            ],
            "placement": {
                "degree": 27.60606298048259,
                "house": 9,
                "name": "neptune",
                "sign": "Capricorn"
            },
            "sign_txt": [
                "With Neptune in Capricorn, there may be a flair for the creative use of natural material. This placing makes for a determined but cautious individual who will not likely be vulnerable to the escapist tendencies of Neptune. Not likely to take the easy way out of difficult situations."
            ]
        },
        "pluto": {
            "aspects": [{
                    "accuracy": 1.3066345160673336,
                    "planet_a": "uranus",
                    "planet_b": "pluto",
                    "type": "sextile"
                },
                {
                    "accuracy": 13.962558656022367,
                    "planet_a": "sun",
                    "planet_b": "pluto",
                    "type": "trine"
                },
                {
                    "accuracy": 7.009262563127322,
                    "planet_a": "mars",
                    "planet_b": "pluto",
                    "type": "trine"
                },
                {
                    "accuracy": 2.9667821539515273,
                    "planet_a": "saturn",
                    "planet_b": "pluto",
                    "type": "trine"
                },
                {
                    "accuracy": 0.2818704251880604,
                    "planet_a": "venus",
                    "planet_b": "pluto",
                    "type": "opposition"
                }
            ],
            "house_txt": [
                "If you have Pluto in the 6th House, great personal transformations can occur because of your work or your workplace environment. You may have the desire to become involved in workplace issues or labor union goings-on. You strive for cooperation and thoroughness in your work habits and you can be a hard taskmaster for fellow employees or for the workers under your command. Guard against trying to be too controlling of how they work. You have the ability to work long hours on nervous energy until your body cannot take any more. You enjoy troubleshooting and solving problems that others cannot solve. Detective work on the job is fun for you. You have the ability to encourage people to discuss deep-seated problems and then analyze the problems logically. There may be an interest in healing. You could be a channel for healing or you might simply be a hypochondriac. You are apt to unconsciously project criticalness to fellow workers without speaking. There may be difficulties through infectious, deep-seated diseases or problems in the colon area."
            ],
            "placement": {
                "degree": 2.8426312294049296,
                "house": 6,
                "name": "pluto",
                "sign": "Sagittarius"
            },
            "sign_txt": [
                "People with Pluto in Sagittarius are understanding and philosophical. Personal transformation can occur especially through philosophical searching. Pluto in this position strengthens their innate (not learnt) religious consciousness and feeling. We can expect them to create a new spiritual or mystical direction, and attempts to merge existing religions and churches."
            ]
        },
        "rising": {
            "aspects": [{
                    "accuracy": 6.791623821742974,
                    "planet_a": "sun",
                    "planet_b": "rising",
                    "type": "sextile"
                },
                {
                    "accuracy": 0.16167227115207794,
                    "planet_a": "mars",
                    "planet_b": "rising",
                    "type": "sextile"
                }
            ],
            "placement": {
                "degree": 10.013566063684337,
                "house": 1,
                "name": "rising",
                "sign": "Gemini"
            },
            "sign_txt": [
                "A lot of nervous energy surrounds these people. It’s obvious how much they dart from one thing to the next, whether that’s regarding the things they speak of or the activities they do. Regardless, there is a clear restlessness or high-strung energy that is present. The way that they make conversation is very distinct. Sometimes, they are compulsive talkers, saying whatever pops in their head in an almost stream of consciousness style. And in spite of their intelligence, they can come off as airheaded because of it. Other times, they can be thinking and thinking so hard that the conversation becomes awkward. But, no matter what, they are funny and often times they are unintentionally funny. Their duality is obvious and they can speak of themselves in 3rd person or like a detached observer. Extra points for talk of a “split personality” or “alter ego”. Their face is often quite chilly, sometimes downright bored, but can suddenly light up with mischief and curiosity."
            ]
        },
        "saturn": {
            "aspects": [{
                    "accuracy": 2.6849117287634385,
                    "planet_a": "venus",
                    "planet_b": "saturn",
                    "type": "sextile"
                },
                {
                    "accuracy": 4.2734166700188325,
                    "planet_a": "saturn",
                    "planet_b": "uranus",
                    "type": "sextile"
                },
                {
                    "accuracy": 2.2697860949708115,
                    "planet_a": "saturn",
                    "planet_b": "neptune",
                    "type": "sextile"
                },
                {
                    "accuracy": 2.9667821539515273,
                    "planet_a": "saturn",
                    "planet_b": "pluto",
                    "type": "trine"
                }
            ],
            "house_txt": [
                "If you have Saturn in the 11th House, you have many acquaintances, but only a few close friends, probably older ones. The friendships you make endure for many years. You are attracted to groups which have a serious or necessary purpose. You feel a strong sense of duty and responsibility to the groups you become involved in. The tasks that you do for any groups may receive very little personal recognition and may require hard work. In order to attain your goals and objectives, you have to be patient and willing to work hard. If your lessons are learned, the later part of life will offer greater rewards. You may experience a sense of never fitting in with the people or groups around you because of some perceived uniqueness. In any case there may be issues regarding feeling different from others."
            ],
            "placement": {
                "degree": 29.875849075453402,
                "house": 11,
                "name": "saturn",
                "sign": "Pisces"
            },
            "sign_txt": [
                "If you have Saturn in Pisces, it may be difficult for you to set boundaries for yourself and others, or to be as disciplined and organized as you want or need to be. Things have a way of getting lost in the shuffle of everyday life and it may be hard for you to keep your touch on the pulse of things around you. Sometimes you just get lost in the fog and can't see your way clearly. You are intuitive, sympathetic, sensitive, imaginative and self-sacrificing. You are a practical idealist and have a tendency to take life perhaps too seriously. You may have the sense that your present life's troubles are due to actions from the past. And this is probably the truth. You must reap what you have sown in previous lives and Saturn comes to exact his payment. Perhaps this is why you tend to feel more sorrow, perhaps, than the usual person. There can be success in working behind the scenes, away from the public eye, perhaps doing research or working in institutions. On the negative side you can be indecisive and moody, with a tendency to react emotionally to negative conditions or people. Depression can set in if success escapes you or if you feel that you have been unfairly treated. You need to develop faith in the future and let go of the past. Dis-identifying from other people's troubles will allow you to help them in their own sorrows. Teaching what you have learned in your experiences is a fine road to soul growth."
            ]
        },
        "sun": {
            "aspects": [{
                    "accuracy": 9.587056001058897,
                    "planet_a": "sun",
                    "planet_b": "mercury",
                    "type": "cunjunction"
                },
                {
                    "accuracy": 6.953296092895073,
                    "planet_a": "sun",
                    "planet_b": "mars",
                    "type": "cunjunction"
                },
                {
                    "accuracy": 14.244429081210455,
                    "planet_a": "sun",
                    "planet_b": "venus",
                    "type": "sextile"
                },
                {
                    "accuracy": 12.655924139955061,
                    "planet_a": "sun",
                    "planet_b": "uranus",
                    "type": "sextile"
                },
                {
                    "accuracy": 6.791623821742974,
                    "planet_a": "sun",
                    "planet_b": "rising",
                    "type": "sextile"
                },
                {
                    "accuracy": 7.832022305504154,
                    "planet_a": "sun",
                    "planet_b": "midheaven",
                    "type": "sextile"
                },
                {
                    "accuracy": 0.37819063749219595,
                    "planet_a": "sun",
                    "planet_b": "jupiter",
                    "type": "square"
                },
                {
                    "accuracy": 10.800873095055294,
                    "planet_a": "sun",
                    "planet_b": "neptune",
                    "type": "square"
                },
                {
                    "accuracy": 13.962558656022367,
                    "planet_a": "sun",
                    "planet_b": "pluto",
                    "type": "trine"
                },
                {
                    "accuracy": 0.8285048622033742,
                    "planet_a": "sun",
                    "planet_b": "moon",
                    "type": "quincunx"
                }
            ],
            "house_txt": [
                "If you have the Sun in the 12th house, there is the desire or the need to serve others in this lifetime. At times this is in direct conflict with a desire to seek seclusion from the world and/or wallow in self-pity seeking sympathy and service from others. This life may be a contemplative life due to the need to reshape negative character traits from past lives. You have an awareness of the oneness of life. You may lack confidence in your abilities. You have an empathy with sick or mentally disturbed people. You may develop or have clairvoyant powers and an interest in occult subjects and psychic phenomena. You may enjoy playing the martyr."
            ],
            "placement": {
                "degree": 16.805189885427307,
                "house": 12,
                "name": "sun",
                "sign": "Aries"
            },
            "sign_txt": [
                "Aries sun natives can be inspirational, courageous, enthusiastic, original, independent, impatient, aggressive, headstrong, selfish, self-centered, and impulsive. The Aries person’s energies are directed toward building a new individuality, thus all the Aries’ energies are directed towards themselves and what they want. An Aries likes roles where their leadership abilities are put on display. Aries natives have executive and organizing ability which is mainly directed in starting things. Sustaining projects is not their strength, but initiating projects is. The tendency to \"damn the torpedoes\" and ram full-speed ahead must be controlled. Aries natives are capable of great accomplishments if they learn how to constructively use their abundant energies. Aries natives are naturally enthusiastic and are always ready for activity and competition. They are inspiring to others because of these tendencies. Ideas and creative projects seem to flow from them in a never-ending stream. They are full of energy and never lack courage.\nBecause Aries natives can be pretty self-centered, they must remember that other people may have good ideas and can assume responsibility and leadership roles, too. The natural tendency for an Arian is to stand alone and do everything themselves. But cooperation with others can be very effective in getting things done to the end rather than simply starting things and quitting before completion. Aries natives have a tendency to start a project, then to suddenly lose interest in it if progress is too slow or things have become too complicated.\nAries natives are very straight-forward and are neither subtle nor devious. They say what's on their mind and they pull no punches. They don't hold grudges and although they can get quite angry, they do not hold it in and stew about what bothers them. They blow in and out like some great Midwestern thunderstorm. It may be violent while it lasts, but it is usually over quickly.\nAries natives are prone to headaches due to tension. Aries natives are usually aggressive in relationships and generally take the lead. They go after what interests them and the chase may be more fun for them than the conquest.\nFour things an Arian should learn are patience, conservation of energy, completion, and control of temper."
            ]
        },
        "uranus": {
            "aspects": [{
                    "accuracy": 4.823901834450908,
                    "planet_a": "uranus",
                    "planet_b": "midheaven",
                    "type": "cunjunction"
                },
                {
                    "accuracy": 12.655924139955061,
                    "planet_a": "sun",
                    "planet_b": "uranus",
                    "type": "sextile"
                },
                {
                    "accuracy": 5.7026280470600454,
                    "planet_a": "mars",
                    "planet_b": "uranus",
                    "type": "sextile"
                },
                {
                    "accuracy": 4.2734166700188325,
                    "planet_a": "saturn",
                    "planet_b": "uranus",
                    "type": "sextile"
                },
                {
                    "accuracy": 1.3066345160673336,
                    "planet_a": "uranus",
                    "planet_b": "pluto",
                    "type": "sextile"
                },
                {
                    "accuracy": 11.827419277751687,
                    "planet_a": "moon",
                    "planet_b": "uranus",
                    "type": "square"
                },
                {
                    "accuracy": 1.588504941255394,
                    "planet_a": "venus",
                    "planet_b": "uranus",
                    "type": "trine"
                }
            ],
            "house_txt": [
                "If you have Uranus in the 10th House, you are not a conformer and do not wish a career that is stable, uneventful and commonplace. You are highly independent and may wish to be self-employed. Your rebellious nature may cause you to do the opposite of what you are told to do in your line of work. Your strong imagination, intuition and creativity will be applied to any career you choose. Sudden changes in job fortune are probable. Routine work drives you batty. A career in electronics, computers, invention, metaphysics or mechanics is possible."
            ],
            "placement": {
                "degree": 4.149265745472235,
                "house": 10,
                "name": "uranus",
                "sign": "Aquarius"
            },
            "sign_txt": [
                "Uranus rules Aquarius, so these people will have many of the general Aquarian traits. They may be friendly and humanitarian, but independent and emotionally detached. Uranus’s influence is greater than usual here because it’s in its own sign. As always, its influence increases even more if Uranus is a personal planet in the chart."
            ]
        },
        "venus": {
            "aspects": [{
                    "accuracy": 14.244429081210455,
                    "planet_a": "sun",
                    "planet_b": "venus",
                    "type": "sextile"
                },
                {
                    "accuracy": 7.291132988315383,
                    "planet_a": "venus",
                    "planet_b": "mars",
                    "type": "sextile"
                },
                {
                    "accuracy": 2.6849117287634385,
                    "planet_a": "venus",
                    "planet_b": "saturn",
                    "type": "sextile"
                },
                {
                    "accuracy": 1.588504941255394,
                    "planet_a": "venus",
                    "planet_b": "uranus",
                    "type": "trine"
                },
                {
                    "accuracy": 4.95469782373425,
                    "planet_a": "venus",
                    "planet_b": "neptune",
                    "type": "trine"
                },
                {
                    "accuracy": 6.412406775706302,
                    "planet_a": "venus",
                    "planet_b": "midheaven",
                    "type": "trine"
                },
                {
                    "accuracy": 0.2818704251880604,
                    "planet_a": "venus",
                    "planet_b": "pluto",
                    "type": "opposition"
                }
            ],
            "house_txt": [
                "If you have Venus in the 12th House, your love of solitude and being your own best company may cause you to want to retreat from society. Pleasures are enjoyed in secret or behind the scenes. Clandestine relationships are possible. Self-indulgence through drink, drugs or sex can bring on self-undoing. There is a strong sense of compassion and a willingness to help and serve others. You may be a sucker for a good sob story. Success by social standards is unimportant to you. You want an understanding of the meaning of life. There is a tendency to keep relationships with the opposite gender a secret. You seldom reveal your innermost feelings. This position usually gives an interest in psychic or occult subjects."
            ],
            "placement": {
                "degree": 2.560760804216855,
                "house": 12,
                "name": "venus",
                "sign": "Gemini"
            },
            "sign_txt": [
                "If you have Venus in Gemini, in matters of love and romance, a person's sense of humor, intellect, and communication skills attract you more than their physical appearance. You desire a partner who is mentally stimulating, curious, one who can challenge your mind, and keeps you from getting bored. Relationships where talking, sharing ideas, going places, and learning new things together are highly preferred and needed. You need a lot of social stimulation and can be a bit of a flirt. Jealous and possessive partners turn you off. You are charming, friendly, and enjoy meeting new people. You can be fickle in matters of love and may have a tendency to desire more than one love interest at a time. You enjoy the fun and excitement of love, yet may fear its obligations. Your feelings can be well expressed through speaking, through writing or poetry, or perhaps through art where you get a chance to work with your hands. Your emotions are ruled by your mind and you may prefer intellectualizing your feelings. If Venus if poorly aspected, your breathing may be shallow and there may be poor oxygenation of the blood."
            ]
        }
    }
}